# TextQualifier Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewScheduleExportOptions..::..TextQualifier Property
ViewScheduleExportOptions Class See Also
---
How to qualify text fields. Default is DoubleQuote.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ExportTextQualifier TextQualifier { get; set; }
```

Visual Basic
---
```text
Public Property TextQualifier As ExportTextQualifier
	Get
	Set
```

Visual C++
---
```text
public:
property ExportTextQualifier TextQualifier {
	ExportTextQualifier get ();
	void set (ExportTextQualifier value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ViewScheduleExportOptions Class
Autodesk.Revit.DB Namespace